# Terraform `environment` `test`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPWNjNmI1ODg2LTM2YWYtNGQ1NC05ZDMwLTFiMGZmZmM3MzZkODt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.observability.azurerm_role_assignment.otel_collector_metrics_publisher[0] will be created
  + resource "azurerm_role_assignment" "otel_collector_metrics_publisher" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "567854d0-dfd5-4ed9-a281-dbb80caa9dbd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Metrics Publisher"
      + scope                            = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-obs-rg/providers/Microsoft.Insights/dataCollectionRules/corr-at22-obs-amw-mdcr"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @tjololo |
| Action | `pull_request` |
| Working Directory | `./infrastructure/altinn-correspondence-test/corr-at22-aks-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/corr-at22-aks-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_corr-at22-aks-rg.tfstate.tfplan` |